{
  "PaperTitle": "Towards Better Detection and Analysis of Massive Spatiotemporal Co-Occurrence Patterns",
  "Year": 2021,
  "HighBlocks": [
    {
      "HighBlockName": "Data Loading",
      "IntermediateBlocks": [
        {
          "IntermediateBlockName": "Loader",
          "GranularBlocks": [
            {
              "GranularBlockName": "Urban Spatiotemporal Datasets",
              "ID": 1,
              "PaperDescription": "Loads heterogeneous urban data from multiple domains, including traffic status, air quality, and weather data into the system.",
              "Inputs": [
                "Traffic status data",
                "Air quality data",
                "Weather data"
              ],
              "Outputs": [
                "Raw spatiotemporal datasets for indexing and mining"
              ],
              "ReferenceCitation": "Section III-A, Table I: The data sources used in this study are shown in Table I with their properties.",
              "FeedsInto": [
                2
              ]
            }
          ]
        }
      ]
    },
    {
      "HighBlockName": "Data Processing",
      "IntermediateBlocks": [
        {
          "IntermediateBlockName": "Indexing",
          "GranularBlocks": [
            {
              "GranularBlockName": "Spatiotemporal Index",
              "ID": 2,
              "PaperDescription": "Builds a unified index for large-scale heterogeneous spatiotemporal data by dividing the map into spatial grids and organizing instances temporally in B+ trees.",
              "Inputs": [
                "Raw spatiotemporal datasets"
              ],
              "Outputs": [
                "Unified spatiotemporal index structure"
              ],
              "ReferenceCitation": "Section IV-A: At this stage, we build a unified index for large-scale heterogeneous spatiotemporal data (Fig. 2(a)) to enable faster data retrieval with different mining parameters specified and accelerate the subsequent mining stages.",
              "FeedsInto": [
                3
              ]
            }
          ]
        },
        {
          "IntermediateBlockName": "Pattern Mining",
          "GranularBlocks": [
            {
              "GranularBlockName": "Co-occurring Instance Generation",
              "ID": 3,
              "PaperDescription": "Generates co-occurring instances with co-occurrence tables and pruning graphs by issuing range queries within spatial and temporal thresholds.",
              "Inputs": [
                "Unified spatiotemporal index",
                "Mining parameters (spatial distance, temporal window, co-occurrence coverage threshold)"
              ],
              "Outputs": [
                "Co-occurrence tables",
                "Pruning graphs"
              ],
              "ReferenceCitation": "Section IV-B: The proposed mining framework attempts to extract co-occurring instances with co-occurrence tables and pruning graphs (Fig. 3) from the spatiotemporal index built at the previous stage.",
              "FeedsInto": [
                4
              ]
            },
            {
              "GranularBlockName": "Low-Level Pattern Mining",
              "ID": 4,
              "PaperDescription": "Finds significant combinations of co-occurring value ranges between properties by aggregating them into value matrices and applying a sweep-line algorithm.",
              "Inputs": [
                "Co-occurrence tables",
                "Pruning graphs"
              ],
              "Outputs": [
                "Low-level co-occurrence patterns (property pairs with co-occurring value ranges)"
              ],
              "ReferenceCitation": "Section IV-C1: Low-level pattern mining aims to find significant combinations of the co-occurring value ranges between a property in the target data source and one in another data source by a) aggregating the co-occurring property value ranges... and b) performing a novel sweep-line based algorithm on the value matrices...",
              "FeedsInto": [
                5
              ]
            },
            {
              "GranularBlockName": "High-Level Pattern Mining",
              "ID": 5,
              "PaperDescription": "Generates and validates high-level co-occurrence patterns by intersecting low-level patterns and validating them against co-occurrence coverage thresholds.",
              "Inputs": [
                "Low-level co-occurrence patterns"
              ],
              "Outputs": [
                "High-level co-occurrence patterns (multi-property co-occurrences)"
              ],
              "ReferenceCitation": "Section IV-C2: High-level pattern candidates can be generated by intersecting low-level patterns. A pattern candidate is considered valid only if the number of the instance combinations it covers is larger than λe · |sτ |.",
              "FeedsInto": [
                6,
                7,
                8,
                9,
                10,
                11,
                12,
                13,
                14
              ]
            }
          ]
        }
      ]
    },
    {
      "HighBlockName": "Visualization",
      "IntermediateBlocks": [
        {
          "IntermediateBlockName": "Geospatial",
          "GranularBlocks": [
            {
              "GranularBlockName": "Map 2D",
              "ID": 11,
              "PaperDescription": "Displays the spatial distribution of pattern instances on a 2D map, with donut charts indicating the counts and ratios of selected pattern groups at each location.",
              "Inputs": [
                "Spatial locations of pattern instances"
              ],
              "Outputs": [
                "2D map visualization with spatially aggregated donut charts"
              ],
              "ReferenceCitation": "Section V-D: The top of the view shows the spatial distribution of the pattern instances on a map. In this study, we use air quality data as the target data source. Each air quality station is represented by a donut chart whose radius encodes the total number of pattern instances in this location.",
              "FeedsInto": [
                16
              ]
            },
            {
              "GranularBlockName": "Overlay (Donut Chart)",
              "ID": 12,
              "PaperDescription": "Overlays the 2D map with donut charts to represent the ratios and counts of co-occurrence pattern instances at each spatial location.",
              "Inputs": [
                "Aggregated pattern instance data",
                "Spatial location data"
              ],
              "Outputs": [
                "Donut chart overlay on 2D map"
              ],
              "ReferenceCitation": "Section V-D: Each air quality station is represented by a donut chart whose radius encodes the total number of pattern instances in this location. The sectors in different colors indicate the ratios of the pattern instances of each group selected from CorView in each location.",
              "FeedsInto": [
                11
              ]
            }
          ]
        },
        {
          "IntermediateBlockName": "Infovis",
          "GranularBlocks": [
            {
              "GranularBlockName": "Matrix",
              "ID": 6,
              "PaperDescription": "Displays property combinations and their associated co-occurrence patterns using a matrix-based layout to provide a scalable overview and allow comparison.",
              "Inputs": [
                "High-level co-occurrence patterns"
              ],
              "Outputs": [
                "Matrix visualization of property combinations with co-occurrence summaries"
              ],
              "ReferenceCitation": "Section V-B1: We adopt a scalable matrix-based approach (the volume challenge) to visualize the property combinations shared by massive co-occurrence patterns (R1) and provide an unified overview for the diverse data properties among the patterns (the diversity challenge).",
              "FeedsInto": [
                7,
                8,
                9,
                14,
                15
              ]
            },
            {
              "GranularBlockName": "Scatter Plot",
              "ID": 7,
              "PaperDescription": "Displays co-occurrence patterns within a selected property combination using a similarity-based scatterplot to support grouping and anomaly detection.",
              "Inputs": [
                "High-level co-occurrence patterns (filtered by property combination)"
              ],
              "Outputs": [
                "Scatter plot of pattern similarity"
              ],
              "ReferenceCitation": "Section V-B2-a: A scatterplot is used to display the co-occurrence patterns, such that similar patterns are naturally grouped together. This scatterplot provides a concise overview of pattern relationships with less clutter than parallel coordinates.",
              "FeedsInto": [
                15
              ]
            },
            {
              "GranularBlockName": "Parallel Coordinates Plot",
              "ID": 8,
              "PaperDescription": "Displays multidimensional co-occurrence patterns as parallel coordinates, with density maps encoding the distribution of value ranges for each property.",
              "Inputs": [
                "High-level co-occurrence patterns (filtered by property combination)"
              ],
              "Outputs": [
                "Parallel coordinates chart showing property co-occurrences"
              ],
              "ReferenceCitation": "Section V-B2-b: Thus, parallel coordinates are used as a uniform view to display the multidimensional co-occurrence patterns. Each axis represents a property. The medians of the ranges are used as the end points of the line segments to connect the value ranges in various property axes.",
              "FeedsInto": []
            },
            {
              "GranularBlockName": "Stacked Line Chart",
              "ID": 9,
              "PaperDescription": "Provides a compact visualization of grouped patterns, where the value ranges for each property are stacked to form a distribution map.",
              "Inputs": [
                "Grouped co-occurrence patterns"
              ],
              "Outputs": [
                "Stacked line chart visualizing grouped pattern distributions"
              ],
              "ReferenceCitation": "Section V-B2-c: In the chart, the value range for each property is represented by a fine line segment. The segments are stacked to compose a distribution map.",
              "FeedsInto": []
            },
            {
              "GranularBlockName": "Line Chart",
              "ID": 10,
              "PaperDescription": "Visualizes the temporal distribution of pattern instances in STView, enabling selection of temporal windows for further filtering.",
              "Inputs": [
                "Pattern instances over time"
              ],
              "Outputs": [
                "Temporal histogram or line chart of instance distributions"
              ],
              "ReferenceCitation": "Section V-D: The bottom of the view shows a histogram to visualize the temporal distributions of pattern instances with multiple scales.",
              "FeedsInto": [
                16
              ]
            },
            {
              "GranularBlockName": "Bar Chart",
              "ID": 13,
              "PaperDescription": "Displays the statistical distributions of property value ranges in a line chart (upper part) and presents a range distribution in a stacked rectangle chart (lower part).",
              "Inputs": [
                "Pattern data distributions",
                "Property statistics"
              ],
              "Outputs": [
                "Statistical distribution charts for value ranges of properties"
              ],
              "ReferenceCitation": "Section V-C: StatView is used to display the pattern distribution of each property (Fig. 4) (R2). This pattern distribution comprises small multiples that display the distributions of the value ranges for the properties.",
              "FeedsInto": [
                16
              ]
            },
            {
              "GranularBlockName": "Table",
              "ID": 14,
              "PaperDescription": "Provides a tabular display of pattern details, including property combinations, co-occurrence patterns, and their instance counts.",
              "Inputs": [
                "High-level co-occurrence patterns",
                "Pattern instance data"
              ],
              "Outputs": [
                "Tabular display of detailed co-occurrence pattern data"
              ],
              "ReferenceCitation": "Section V-E: PatTable is a table-like component that allows users to inspect raw patterns directly on demand.",
              "FeedsInto": [
                6
              ]
            }
          ]
        }
      ]
    },
    {
      "HighBlockName": "Interaction",
      "IntermediateBlocks": [
        {
          "IntermediateBlockName": "Filter",
          "GranularBlocks": [
            {
              "GranularBlockName": "Brushing and Grouping",
              "ID": 15,
              "PaperDescription": "Enables users to group patterns and highlight anomalies by brushing on scatterplots, allowing for comparison and focused exploration.",
              "Inputs": [
                "User-selected regions in scatterplots"
              ],
              "Outputs": [
                "Grouped patterns for comparison in visualizations"
              ],
              "ReferenceCitation": "Section V-F: Users are allowed to group patterns or spot anomalies by brushing the patterns with colors in a scatterplot in CorView.",
              "FeedsInto": [
                9
              ]
            },
            {
              "GranularBlockName": "Spatiotemporal Filtering",
              "ID": 16,
              "PaperDescription": "Enables filtering of pattern instances by spatial area on the map and temporal window on the timeline to refine analysis.",
              "Inputs": [
                "User-drawn spatial regions",
                "User-selected temporal windows"
              ],
              "Outputs": [
                "Filtered patterns and pattern instances across views"
              ],
              "ReferenceCitation": "Section V-F: Users can filter by spatial area, time range, and property value range in STView and StatView.",
              "FeedsInto": [
                11,
                10,
                13
              ]
            }
          ]
        },
        {
          "IntermediateBlockName": "Configuration",
          "GranularBlocks": [
            {
              "GranularBlockName": "Mining Parameter Adjustment",
              "ID": 17,
              "PaperDescription": "Allows users to change mining parameters such as spatial distance, temporal window, and co-occurrence coverage to adjust pattern extraction.",
              "Inputs": [
                "User-defined mining parameters"
              ],
              "Outputs": [
                "New co-occurrence patterns based on user-specified parameters"
              ],
              "ReferenceCitation": "Section V-F: Users can change the parameters including the spatiotemporal threshold and minimum co-occurrence coverage (Fig. 10(a)) and see new results (R5).",
              "FeedsInto": [
                2
              ]
            }
          ]
        }
      ]
    }
  ]
}